Cats_99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "sex" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "brown"], ["sex", "F"], ["description", "Is not an angry cat "], ["updated_at", "2019-01-30 00:53:15.305184"], ["id", 2]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)